Revit 2026 API

# MultiSegmentGridText Property

---

name shared by grids in this MultiSegmentGrid

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Text { get; set; }
```
```vb
Public Property Text As String
	Get
	Set
```
```cpp
public:
property String^ Text {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Text : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

MultiSegmentGrid Class

Autodesk.Revit.DB Namespace